{"pageProps":{"data":{"title":"(閱後感) 給未來總統的能源課：頂尖物理學家眼中的能源真相","date":"2020-10-13","slug":"energy-for-future-presidents","tags":["Science","Energy","Monthly Reads,","Richard A. Muller"],"categories":["Books"]},"content":"\n活在高度依賴能源的時代，我們從小被教育能源的重要性。在享受能源帶來的便利時，同時也切身感受到各種能源帶來的問題。全球暖化，核災難或各種開採能源的生態事故，都在提醒人類，著手解決能源危機的逼切性。在環保團體及媒體的大肆宣傳下，大眾對能源安全的關注的確有所提升。關注固然重要，但如何做才是正確，又是另一回事。在看畢本書之後，發覺自己的確對能源有不少偏見及誤解。涉及科學的問題，果然還是要以真確的數據，及不偏頗的心態去看待。\n\n### 能源重要嗎？\n\n記得在中學時的物理課，首先學習的便是能量守恆定律。它闡明孤立系統的總能量保持不變。能量不會被減少或增加，只能被轉移，並以不同的形式存在 - 例如電能，核能及熱能等等。從古人用來生火的木材，直到今天我們用來燃燒發電的石油或煤炭，我們主要使用的能源仍然是化學能(燃料)。在現代社會，人類無論衣食住行，甚至娛樂文化各方面，都得依賴能量。\n\n發達國家主要使用的能源是電力、汽油、天然氣等。除了電力可以用其他方法產生之外，其餘都是由石油提煉。使用石油的歷史大致追溯到上世紀五，六十年代。由於運輸方便，能量密度高，很快便成為全球主要使用的能源之一。今天大部份的基建設施、發電廠，運輸管道甚至我們的交通工具，都是針對石油而建造。\n\n可惜各種化石燃料都是不可再生的能源，終有一天會被我們耗盡。而且燃燒燃料產生的氣體如二氧化碳、甲烷、一氧化碳等等，均會加劇全球暖化及空氣污染帶來的氣候及環境問題。著手尋找潔淨及可再生能源，是各個國家必須積極處理的問題。\n\n### 能源的替代\n\n發電除了主要依靠燃燒燃料之外，其實還有很多種方法。\n\n* 核能發電\n  * 核裂變 - 鈾的分裂的連鎖反應\n  * 核聚變 - 氫的融合的連鎖反應\n* 太陽能發電\n  * 光電轉換 / 光熱轉換\n* 潮汐發電\n* 風力發電\n* 地熱發電\n\n這些技術應該已經非常耳熟能詳。除了核能外，其餘都是可再生能源。它們的優點當然是用之不竭，潔淨環保。不過產能及發電效率高度依賴環境條件。現時的產能並不足以支撐人類的需求，頂多只能作輔助使用。\n\n正正因為可再生能源非常依賴環境，若果開採方法不當，其實也會破壞環境。例如水力發電的渦輪機會破壞生態；又或是吸走了地熱能量後，其實地球需要很長時間才能恢復，並非真正用之不盡的可再生能源。在可見的將來，可再生能源未必能成為主流。不過，若果地理環境許可，而產能又足夠的話，潔淨的能源一定是最優先的選擇。\n\n### 可行的方案\n\n回想起來我們使用石油的歷史並不算很長久，由木材到煤炭，煤炭到鯨油以至石油。其實我們也經歷了數次轉換的過程。作者指出，美國蘊含豐富的天然氣及頁岩油，是最有機會可以替代石油的能源。\n\n天然氣是相對乾淨的燃料，它會排放較少的溫室氣體及污染物。只要把天然氣液化，便可減低運輸困難。隨著開採技術進步，天然氣的產量穩定，而且存量豐富。如果消耗量保持目前的水平，已知可開採的天然氣資源將足以供人類使用達二百年左右。可以為可再生能源的研究爭取一點時間。\n\n### 能源安全\n\n談起核能，你想起甚麼？切爾諾貝爾？或者是福島核災？作者在前段用了頗長的篇幅描述了幾個能源災難，其中一個是日本福島核事故。\n\n核能使用的是輕鈾，而不是製造核彈的高濃縮鈾。海島旁的核電廠進行核裂變持續放出能量產生蒸氣發電，並以海水冷卻。核電的主要危機不是來自物理性傷害，而是在於核廢料的洩漏。\n\n自然界本來就充滿幅射，位於美國丹佛的自然幅射量很高，但患癌的居民沒有特別多。作者這裡想帶出的是，核洩漏造成的甲狀腺癌是可以被醫治的，其他類型的癌症與幅射未必有直接的關係。在其他因核幅射造成的影響被證實前，負面影響就已經被媒體及環保團體放大渲染。若果大眾不抱批判態度去思考，過度的恐慌及擔憂反而會令人類的能源發展停滯不前。\n\n### 從節能做起\n\n能源的轉化效率並不是百分百，大部份會轉化為熱能或摩擦力消失於環境之中。除了不斷開拓新能源，積極地減少能源的消耗也同樣重要。\n\n有些技術如混合動力車輛，可以用電池進行再生制動，把剎車的反作用力產生電力，比純電能車有更高的能源效益。\n\n又例如智慧電網；要知道發電廠的電是不能儲存起來的。要維持穩定的供電，很多時侯會供過於求。若果能夠根據用戶真實的使用情況發電而控制價格，提供用戶自主節能的誘因，將有效地減低很多用電需求。\n\n書籍購自Amazon:\nhttps://www.amazon.com/gp/product/B07N91H37W/ref=ppx_yo_dt_b_d_asin_image_o01?ie=UTF8&psc=1\n","recent":[{"url":"a-little-history-of-economics","data":{"title":"經濟學的40堂公開課(A Little History of Economics) 閱讀筆記","date":"2020-12-06","categories":["Books"],"tags":["Economics","Monthly Reads","Niall Kishtainy"],"slug":"a-little-history-of-economics"},"content":"\n作為一個生活在金融城市的人，我好像從小便聽大人說經濟這個字。大家都很想經濟好，彷彿經濟好了，生活便會好了。但過了這些年，經濟好了，但生活有跟著變好嗎？我不以為然。\n\n大學時讀過一些很基本的demand supply，economic of scale等理論。但這不是我想像中的經濟學。在我看來，我覺得經濟學更像社會學。看了這本書後，知道了經濟學的簡史。尤其是近代新派的經濟學說，基本上很多理論到今天還在應用。有感經濟理論對人類的影響是如此深，也加深了自己本身的想法。\n\n書本以小節形式結集，總共40節。在此紀錄數項重要的理論作為自己的筆記：\n\n#### 重商主義\n\n十六，七世紀的貨幣主要為貴金屬，要支撐國家開支，便需要累積大量黃金與白銀。貴金屬有限，要賺取財富，唯有加強貨物出口。建立貿易壁壘，以關稅限制入口貨品。同時積極殖民，控制原材料，從而減少對進口物品的依賴，鼓勵貿易順差。\n\n#### 重農主義\n\n農業取之大自然，是淨產出。從事加工活動的工業及資產階級的地主是建基於農業的淨餘產出。農業生產的剩餘越多，在各階級流動的資源便越多。要鼓勵農業發展，便要減低對農民的課稅。將之轉嫁予擁有土地的貴族。除此以外，廢除商人及工業者的特權，加大農民能賺取的利潤。\n\n#### 國富論\n\n人們根據自身利益行事，社會就能好好運作。自利帶來社會和諧，而不是混亂。政府不應該干預整個自由市場，經濟體應該自由運作，就像有一隻看不見的手在安排。\n\n專業化分工讓成本下降，產量提升。人民的所有生產，無論工業、農業，都是國家的財富。而且生產什麼由市場主導。\n\n#### 馬克斯與共產主義\n\n共產主義的原意在於已發展的高度資本主義社會。顧名思義，共產主義制度下沒有私有財產。人們的工作量應等同足夠生活所需的勞動價值，額外的勞動就是剩餘價值。\n資本家剝削工人的剩餘價值，社會大眾能夠花費越少，產品需求下降，資本家的產品也會賣不出去。整套體系終會崩潰。\n\n而且擁有資本能操控意識型態，必須由少數人控制的社會變為去中心化的社會。反對過度專業化分工，因其使人失去人性及自身價值。\n\n#### 福利經濟學\n\n自由經濟的市場自行調整有時會失靈，福利經濟學檢討決策為社會帶來的整體福利。自身利益最大化的自利行為可能會忽視對整體社會的負面影響。Public Goods如免費的公共服務及政府補貼就不是自由市場的最佳效果，但對整個社會有利。\n\n#### 計畫經濟 \n\n資料分配，貨品生產，及消費需求均由中央管理。市場不再由供求決定。因為企業由政府控制，多數為共產主義下的經濟模式。\n\n#### 凱因斯主義\n\n1930年代美國經濟大蕭條，英國的凱因斯嘗試作出解答。富裕的國家應該會越來越富有，衰退的原因不是產量出了問題，而是需求減少。國民存款增加，利率降低本可以增加投資，把資金帶回經濟體。\n此說也認為貨幣政策已失效，利率的變化對投資者的影響有限。人們因為各種問題（可能是信心問題，或對未來的不確定感)，選擇不去投資，經濟就會陷入衰退。\n\n人們不花錢，就由政府搭當花錢的角色。投資各種公共服務，創造就業，帶動消費需求。另一種方法就是減稅，人們有更多可用的錢，更會消費。\n\n#### 貨幣主義\n\n佛利民於60年代提倡此學說。主要駁斥凱因斯學說的政府干預及加大支出理論，同時為貨幣理論解話。在貨幣流通量穩定的狀態下，貨幣供應短期內是確實會增加國民消費及投資。比起政府的投資，干預自由市場運作。此說更傾向在不同的時候調整貨幣政策。放任經濟體自行修正，強化企業的供給面（產出的水準），而不是從需求入手。\n\n#### 熊彼特 創造性破壞\n\n資本主義就代表了改變，而這種改變沒有終點。經濟體並不是一個平衡，而是透過不斷的創新來破壞舊有結構，創造新的結構。以不斷改變推動經濟體。壟斷有助經濟體進步，高風險伴隨高回報。研發新產品的壟斷帶來巨大的獎賞，鼓勵創新。模仿者會跟隨，帶動了整個行業的革新，經濟體隨之擴展。\n\n#### 海耶克\n\n主要批評社會主義及計畫經濟。此說認為政府操控的經濟凌駕個人自由。\n一旦政府操控經濟體，人民將再無法做決定，失去經濟自由，甚至政治自由。\n\n\n書籍購自Amazon:\nhttps://www.amazon.com/gp/product/B07N8ZB43D\n","sortPubDate":1607212800},{"url":"guns-germs-steel","data":{"title":"(閱後感) 槍炮、病菌與鋼鐵 - 人類社會的命運","date":"2020-09-18","slug":"guns-germs-steel","tags":["Humanities","Monthly Reads","RJared Diamond"],"categories":["Books"]},"content":"\n\n中學的時侯，用英語授課。記得當時實在沒什麼興趣聽課，一來聽不明白，二來科目也沒有很有趣。但唯獨是歷史課，倒是聽得著迷。當時好奇，為什麼文藝復興、工業革命會發生在歐洲，而不是其他洲？為什麼早早發展出文明的埃及，沒有令它成為當代的強國？\n\n這些問題一直在我心中沒有答案，直至今天，偶然找了這本名著來看，解答了心中一點疑問。作者賈德．戴蒙是一位地理及生物學者，他對地球上不同民族進行多年的觀察，歸納影響現世不同民族的文明發展度的各種因素。而作者在最後得出一個結論是，其實歸根究底，最主要的一個原因，那個足以影響後世千年的原因，就是各民族身處的起始地理位置。\n\n### 在飽腹之前，任何發展都是空想\n\n在甚至還未發展出農業的時代，食物來源不穩定，維生已經要花掉大量時間，談何發展。能夠首先跨越這道門檻的地區，就是位於中亞的肥沃月灣(Fertile Crescent)。植物必須先經過馴化，才變得適合食用及量產。並不是所有環境都適合馴化植物；這地區有四季分明的氣侯，土地肥沃，豐富的生物多樣性提供人類馴化家畜及植物的良好環境。\n\n已馴化的物種會被傳播至鄰近地區，可惜只傳至歐亞便止步。賈德指出相同的緯度有大致相同的氣侯，橫向的傳播比較容易。反之不同的緯度的縱向傳播，只有少數物種可以適應不同氣候而變異，傳播速度便因而緩慢或停滯。歐亞大陸因為在農業上的快速成長，可以使人口增長，同時有空間發展其政治及科技。沒有受到傳播得益的群落，便需要自行在當地重新馴化適合的物種，發展便會相對緩慢。\n\n除了植物的馴化，動物在人類發展也是舉足輕重。在科技發展之前，動物更是重要的運輸及勞動力。澳洲便是因為缺乏了大型哺乳類可供馴化，致其發展滯後於各大洲。歐洲也因為擁有馬匹，在侵略南美洲的時候，以少數兵力便可壓倒性取勝。戰力比拚固然基於各洲的農業、政經及科技發展速度。但其實更多美洲人是死於歐洲人帶來的病菌。早早擁有動物的文明，經歷各種傳染病的洗禮，活下來的人早已獲得抗體。導致沒有動物的文明可輕易被擊敗。\n\n### 贏在起跑線上\n\n擁有地理優勢的文明，無可否認，的確有利發展，而且優勢更會帶到後世。活在廿一世紀的我們也非常明白。除了中亞，中國及古印度也能自行馴化自己的動植物。中國很早便有各種發明，語言、政治及文化。賈德的一個有趣的觀點是，中國從很早期(秦朝)開始，便已經是統一的狀態。有別於歐洲，還是由不同的國家組成。他指出支離的國家會各自競爭，反而有利於加速科技的發展。\n\n以常理推斷，統一的國家應該有更完整的架構、豐富的資源及相同的語言，如果規劃得宜，我認為是更有利於科學及人文發展。重點在於，文明之間若能互相交流，相互競爭，才會刺激新意念的誕生。\n\n其實中國直至明代依然是一個強大的文明，甚至像哥倫布一樣，有能力航海。只是後來無以為繼，鮮有與其他國家進行探索或交流。在之後的清代更錯失了歐洲的工業化，沒有借鑑歐洲的技術，後來發生的事便是歷史了。統一的大國，很容易造成這種決策的錯失。像這種政治因素，當然也會影響文明的發展，在近代的歷史更尤其明顯。\n\n現今物流及網絡皆發達，除了國家獨有的高端科技外，根本沒有傳遞不了的東西。雖然發展中國家難以扳平發達國家累積的優勢，但差距總會慢慢收窄。只是在全球化的浪潮下，我們也察覺到會有其他經濟及社會問題產生，如何在本土意識與文化交流中尋求一個平衡，將會是下一個世紀需要面對的問題。\n\n\n書籍購自Amazon:\nhttps://www.amazon.com/gp/product/B07WDP5NKD","sortPubDate":1600387200},{"url":"life-3.0","data":{"title":"(閱後感) 生命的第三次進化 - Life 3.0","date":"2020-06-07","slug":"life-3.0","tags":["Science","Artificial Intelligence","Monthly Reads,","Max Tegmark"],"categories":["Books"]},"content":"\n\n要數當代最熱門的科技話題，人工智能 (Artificial Intelligence) 必定是其中之一。彷彿把它作為賣點，產品的價值及效能便會增值不少。\n\n### 但何謂人工智能\n\n也許我們不太意識到，其實作為人類，我們的大腦每分每秒都在處理非常複雜的事情。簡單如分辨圖像、分辨語氣，對電腦來說其實是非常難的事情。我們平常遇到的圖片驗證碼，就是用來區分人類，阻擋電腦攻擊。簡單來說，讓電腦能做到我們能做到的事情，甚至比我們做得更好。就是人工智能研究項目所關注的事情。\n\n### 我們是如何走到這一步\n\n生命的演化被粗略地分為幾何階段，第一個階段，生物純粹地生存，透過基因遺傳演化。這種改變緩慢而非自主，經過重重障礙才演化出像人類這種，能透過知識的傳授與學習，改變內在的「軟體」的生命。人類得以更敏捷地回應環境的挑戰，應付各種更複雜的生存目標。這是第二個階段。\n\n透過各種鍛鍊，我們的身體某程度上能得到改變。但以改變本質來說，其實我們還差得遠。\n\n曾經聽過一個哲學問題，內容大概是；我們的細胞每天都會經歷新陳代謝，當有一天你整個身體的細胞都換了一次，你還是那個你嗎？所以說，只要記憶與智慧不變，在哪個硬體內運作其實分別不大。若有天生命能達到這個目標，就是生命的3.0版本。以現在的科技水平。資訊共享，硬體升級，機械人什麼的，電腦都能做到了，我們都見怪不怪了。唯獨學習與關聯性思考，電腦還有很長的路要走。坦白說，現在的電腦還不夠「聰明」。\n\n大眾對人工智能的擔憂，雖然有點兒過早。但能夠把焦點放在這議題上，引起大家的討論及反思，才是對科學發展應有的態度。作者列舉了數個未來人工智能發展的預想，各有利弊，也沒有絕對的答案；無論人將來類與人工智慧能否並存，或者是任何一方處於主導狀態，都不能否定未來的生命，將會比我們更聰明這個可預期結果。\n\n### 生命的目的是什麼\n\n當未來生命以更長壽或更聰明的形態出現時，他們要解決的問題是什麼？作者是一位物理學家，他比較關注這種演化的目標是什麼。我對物理學的認知不多，有些地方也看不明白。但以我所理解。根據熱力學第二定律說明熱力的平衡狀態是不可逆轉，孤立系统自發地趨向熱平衡，達到熵的最大值。熵是用量度不能轉化為功的能量值，也描述予系統的混亂程度。由於自然界趨向熵的最大化，宇宙隨時間流逝，終有一天會達至[熱寂狀態](https://en.wikipedia.org/wiki/Heat_death_of_the_universe)(Heat Death)。<br><br>\n\n\n> The heat death of the universe, also known as the Big Chill or Big Freeze,[1] is a conjecture on the ultimate fate of the universe, which suggests the universe would evolve to a state of no thermodynamic free energy and would therefore be unable to sustain processes that increase entropy.\n\n<br>\n生命其實是一種相對穩定的負熵狀態，依賴能量抗衡自然發生的熵增。倘若不幸地人類是宇宙唯一的生命體。探索能量，維持生命的延續，就是我們終極的目標。可是，地球能源始終有限，人類轉換能量的效率卻仍然低下。探索太空的必要性就顯得逼切。以現行的科技來說，就算有用不盡的能量，人的壽命也撐不過整趟太空旅程。\n\n### 未來人工智能的發展，會不會是就問題的答案？\n\n無論未來人工智能會怎樣發展，人類都必然會對宇宙有更多發現。工業革命之後，短短二百年人類能以這種速度發展至今。誰又能想到，二百年後會是什麼光境。對各種未知的好奇，謹慎而樂觀，也許是我們一直活著的原因。\n\n\n書籍購自Amazon:\nhttps://www.amazon.com/dp/B06WGNPM7V/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\n\n\n\n\n","sortPubDate":1591488000}]},"__N_SSG":true}